# 06 - Combining datasets

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [9]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [10]:
first = pd.Series(np.random.randint(1,5,100))
second = pd.Series(np.random.randint(1,4,100))
third = pd.Series(np.random.randint(10000,30001,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [11]:
df = pd.concat([first,second,third],axis=1)
df

    0  1      2
0   2  2  15685
1   1  1  10193
2   2  2  26897
3   1  1  26348
4   4  1  10126
.. .. ..    ...
95  1  3  14167
96  1  1  23356
97  4  1  22042
98  4  2  13466
99  1  2  13014

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [12]:
df.rename(columns={0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       2       2            15685
1       1       1            10193
2       2       2            26897
3       1       1            26348
4       4       1            10126
..    ...     ...              ...
95      1       3            14167
96      1       1            23356
97      4       1            22042
98      4       2            13466
99      1       2            13014

[100 rows x 3 columns]

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [13]:
bigcolum =pd.concat([first,second,third],axis=0)
bigcolum

0         2
1         1
2         2
3         1
4         4
      ...
95    14167
96    23356
97    22042
98    13466
99    13014
Length: 300, dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [14]:
len(bigcolum)
#No es cierto, tiene 300 filas

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [16]:
bigcolum.reset_index(drop=True, inplace=True)
bigcolum

0          2
1          1
2          2
3          1
4          4
       ...
295    14167
296    23356
297    22042
298    13466
299    13014
Length: 300, dtype: int32